---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.Remove(Autodesk.Revit.DB.ExportLayerKey)
zh: 删除、移除
source: html/45231c89-3d97-da27-1087-880a5f973ed7.htm
---
# Autodesk.Revit.DB.ExportLayerTable.Remove Method

**中文**: 删除、移除

Removes the pair (key, info) by pattern key.

## Syntax (C#)
```csharp
public void Remove(
	ExportLayerKey exportLayerKey
)
```

## Parameters
- **exportLayerKey** (`Autodesk.Revit.DB.ExportLayerKey`) - The export pattern key.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null